/**
 * @mainpage
 * # Загальне завдання
 * 1. **Реалізувати** функцію, що визначає, скільки серед заданої 
 * послідовності чисел таких пар, у котрих перше число менше наступного
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */
 
#include "stdio.h"
#include "stdarg.h"

int task(int N, ...);

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - вивід результату роботи функції @function task
 * @return успішний код повернення з програми (0)
 */
int main() {
	printf("%d ",task(5, 1, 2, 4, 3, 6));
	return 0;
}

/**
 * @function task
 *
 * Послідовність дій:
 * - прийом кількості чисел, та самих варітивних чисел
 *	@param N кількість змінних
 * - оголошення змінних 
 *	@param rez Результат роботи функції
 *	@param mas[] Масив варіативних чисел
 * - Заповнення масиву числами
 * - Послідовна перевірка чисел на виконання умови програми
 * @return успішний код повернення результату роботи функції (rez)
 */
int task(int N, ...){
	int rez = 0;
	int mas[N];
	va_list args;/**Початок роботи з варіативними аргументами */
	va_start(args, N);
	/**Заповнення масиву числами*/
	for (int i =0; i<N; i++){
		int value = va_arg(args, int);
		mas[i]=value;
	}
	/**Послідовна перевірка виконання умови*/
	for(int i =0; i<N; i++){
		if(i!=N-1){
			if(mas[i]<mas[i+1]){
				rez++;
			}
		}
	}
	va_end(args);/**Кінець роботи з варіативними аргументами*/
	return rez;
}
