/**
 * @mainpage
 * # Загальне завдання
 * 1. **Визначити**, чи є ціле 6-значне число «щасливим» квитком («щасливий квиток» - квиток, 
 * в якому сума першої половини чисел номера дорівнює сумі другої половини.)
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */

#include <stdio.h>
int pol1();

int pol2();

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - оголошення змінних 
 *	@param i початкове число
 *	@param bilet результуюча кількість "щасливих квитків"
 * - поступова перевірка на виконання умови задачи
 * @return успішний код повернення з програми (0)
 */
int main() {
	int i = 100000, bilet=0;
	do {
		if (pol1(i) == pol2(i)){
			//"щасливий квиток"
			bilet++;
		}
		i++;
	} while (1<1000000);
	printf("%d", bilet);
	return 0;
}

/**
 * @function pol1
 *
 * Функція для обчислення суми першої половини числа
 * @return успішний код повернення результату роботи функції (rez)
 */
int pol1(int i){
	int rez = (i-(i%100000))/100000 + ((i%100000-i%10000)/10000) + (i%10000-i%1000)/1000;
	return rez;
}

/**
 * @function pol2
 *
 * Функція для обчислення суми другої половини числа
 * @return успішний код повернення результату роботи функції (rez)
 */
int pol2(int i){
	int rez = (i%1000-i%100)/100 + ((i%100-i%10)/10) + i%10;
	return rez;
}
