/* Визначити, чи є ціле 6-значне число «щасливим» квитком («щасливий квиток» - квиток, 
в якому сума першої половини чисел номера дорівнює сумі другої половини.)*/
int main() {
	int pol1, pol2;
	int i = 100000, bilet=0;
	do {
		pol1 = (i-(i%100000))/100000 + ((i%100000-i%10000)/10000) + (i%10000-i%1000)/1000;
		pol2 = (i%1000-i%100)/100 + ((i%100-i%10)/10) + i%10;
		if (pol1 == pol2){
			//"щасливий квиток"
			bilet++;
		}
		i++;
	} while (1<=1000000);
	/*int i = 100000;
	while (1<=1000000){
		pol1 = (i-(i%100000))/100000 + ((i%100000-i%10000)/10000) + (i%10000-i%1000)/1000;
		pol2 = (i%1000-i%100)/100 + ((i%100-i%10)/10) + i%10;
		if (pol1 == pol2){
			//"щасливий квиток"
		}
		i++;
	}*/
	/*for (int i=100000;1<=1000000; i++){
		pol1 = (i-(i%100000))/100000 + ((i%100000-i%10000)/10000) + (i%10000-i%1000)/1000;
		pol2 = (i%1000-i%100)/100 + ((i%100-i%10)/10) + i%10;
		if (pol1 == pol2){
			//"щасливий квиток"
		}
	}*/
	return 0;
}
