/**
 * @mainpage
 * # Загальне завдання
 * 1. **Заповнити масив** із заданої кількості елеметів простими числами, що не повторюються.
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */

//Заповнити масив із заданої кількості елеметів простими числами, що не повторюються.
#include<stdio.h>

int task (N);

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - вивід результату роботи функції @function task
 * @return успішний код повернення з програми (0)
 */
int main(){
	task(10);	
	return 0;
}

/**
 * @function task
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *	@param N Розмір масиву
 *	@param ch Число з якого починається відбір простих чисел
 *	@param mas[] Масив заданого розміру
 * - вибір всих можливих дільників
 * - визначення чи являє собою задане число простим, якщо так, то запис у масив
 * - виконання циклу до заповнення масиву
 */
int task (int N){
	int stop =0, i=0, ch=2;
	int mas[N];
	while(stop<1){
		for(int j=2; j<=ch; j++){  //цикл для перебора всех возможных делителей
			if(ch%j==0){
				if(ch==j){
					mas[i]=ch;
					i++;
					//prostoe ch
					break;
				} else {
					break;
					//slozhnoe ch
				}
			}
		}
		ch++;
		if (i==N){
			stop++;
		}
	}
	for(int j = 0;j<N;j++){
	printf("%d, ", mas[j] );} 
}
