/**
 * @mainpage
 * # Загальне завдання
 * 1. **Визначити** кількість слів у заданому тексті
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */

#include<stdio.h>
int task(char []);

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - вивід результату роботи функції @function task
 * @return успішний код повернення з програми (0)
 */
int main()
{
    task("Word  Word   Word s ");
    return 0;
}

/**
 * @function task
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *	@param slova Результуюча кількість слів у тексті
 *	@param mas[] Вхідний масив с текстом
 * - Перевірка на виконання умови, якщо є певний символ, за який слідує пустий елемент, 
 *   то слід вважати це одним словом(навіть якщо воно складається з  1 букви)
 * - Вивід результату на екран
 */
int task(char mas[]){
    int slova=0;
    for(int i=0;mas[i]!='\0';i++){
        if(mas[i]!=' '&&mas[i+1]==' '){
            slova++;
        }
    }
    printf("%d", slova);
}
