/*Визначити, у скільки разів значення дробової частини більше за цілу.
Організувати перевірку ділення на 0. Результат "обрізати" до другого 
знака після коми. Наприклад, х = 123.656 -> y = 656/123 = 5.333333 = 5.330000*/
int main() {
	int ch=7, del=1,i=0;
	do {
		del++;
		if (ch%del==0){
			if (ch==del){
				i+=1;
				//число просте
			} else {
				i+=1;
				//число складне
			}
		}
	}
	while (i<1);
	/*while (i<1){
		del++;
		if (ch%del==0){
			if (ch==del){
				i+=1;
				//число просте
			} else {
				i+=1;
				//число складне
			}
		}
	}*/
	/*
	for (i=0; i<1; )*/
	return 0;
}
